In [1]:
import pandas as pd

In [9]:
df1 = pd.DataFrame({
    "ID": [1, 2, 3],
    "Nombre": ["Ana", "Pedro", "Karina"]
})

In [13]:
df2 = pd.DataFrame({
    "ID": [1, 2, 4],
    "Edad": [25, 30, 41]
})

In [11]:
df1

   ID  Nombre
0   1     Ana
1   2   Pedro
2   3  Karina

In [15]:
df2

   ID  Edad
0   1    25
1   2    30
2   4    41

In [17]:
df_combinar = pd.merge(df1, df2)
df_combinar

   ID Nombre  Edad
0   1    Ana    25
1   2  Pedro    30

In [35]:
df_combinar = pd.merge(df1, df2, on = "ID", how="outer")
df_combinar

   ID  Nombre  Edad
0   1     Ana  25.0
1   2   Pedro  30.0
2   3  Karina   NaN
3   4     NaN  41.0

In [49]:
df_indexacion = pd.merge(df1, df2, left_index=True, right_index=True)
df_indexacion

   ID_x  Nombre  ID_y  Edad
0     1     Ana     1    25
1     2   Pedro     2    30
2     3  Karina     4    41

In [63]:
df1 = pd.DataFrame({
    "Salario": [1050, 1800, 1900, 2000],
    "Antiguedad": [2, 2, 10,20]},
    index = [1, 2, 3, 5]
)

In [59]:
df1

   Salario  Antiguedad
1     1050           2
2     1800           2
3     1900          10
5     2000          20

In [65]:
df2 = pd.DataFrame({
    "Ciudad": ["Lima", "Ica", "Trujillo", "Cajamarca"],
    "Jerarquia": ["Alta", "Alta", "Baja", "Media"]},
    index = [1, 2, 3, 4]
)

In [67]:
df2

      Ciudad Jerarquia
1       Lima      Alta
2        Ica      Alta
3   Trujillo      Baja
4  Cajamarca     Media

In [73]:
df_unir = df1.join(df2)
df_unir

   Salario  Antiguedad    Ciudad Jerarquia
1     1050           2      Lima      Alta
2     1800           2       Ica      Alta
3     1900          10  Trujillo      Baja
5     2000          20       NaN       NaN

In [81]:
df_unir = df1.join(df2, how = "right")
df_unir

   Salario  Antiguedad     Ciudad Jerarquia
1   1050.0         2.0       Lima      Alta
2   1800.0         2.0        Ica      Alta
3   1900.0        10.0   Trujillo      Baja
4      NaN         NaN  Cajamarca     Media

In [92]:
df1  = {"Nombre": ["Pepito", "Maria", "Juana"], "Edad": [10, 20, 40]}
df1

{'Nombre': ['Pepito', 'Maria', 'Juana'], 'Edad': [10, 20, 40]}

In [146]:
df2  = {
    "Nombre": ["Juanito", 
    "Ana", "Carla"], 
    "Edad": [15, 22, 54]}
df2

{'Nombre': ['Juanito', 'Ana', 'Carla'], 'Edad': [15, 22, 54]}

In [148]:
df_concatenar1 = pd.DataFrame(df1)
df_concatenar2 = pd.DataFrame(df2)

In [152]:
df_concatenar = pd.concat([df_concatenar1, df_concatenar2])
df_concatenar

    Nombre  Edad
0   Pepito    10
1    Maria    20
2    Juana    40
0  Juanito    15
1      Ana    22
2    Carla    54

In [154]:
df_concatenar = pd.concat([df_concatenar1, df_concatenar2], ignore_index = True)
df_concatenar

    Nombre  Edad
0   Pepito    10
1    Maria    20
2    Juana    40
3  Juanito    15
4      Ana    22
5    Carla    54

In [166]:
df_concatenar = pd.concat([df_concatenar1, df_concatenar2], keys=["df1", "df2"])
df_concatenar

        Nombre  Edad
df1 0   Pepito    10
    1    Maria    20
    2    Juana    40
df2 0  Juanito    15
    1      Ana    22
    2    Carla    54